#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`
#### Checkov 🧪`success`

<details><summary>Show Plan</summary>

```

module.application_insights["app_insight1"].azurerm_application_insights.application_insights: Refreshing state... [id=/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Insights/components/app-insight-elx-demo-001]
module.machine_learning["mlw1"].data.azurerm_storage_account.storage_account: Reading...
module.machine_learning["mlw1"].data.azurerm_key_vault.key_vault: Reading...
module.machine_learning["mlw1"].data.azurerm_application_insights.application_insights: Reading...
module.machine_learning["mlw1"].data.azurerm_subnet.subnet_mlcc["mlcc1"]: Reading...
module.machine_learning["mlw1"].data.azurerm_key_vault.key_vault: Read complete after 0s [id=/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.KeyVault/vaults/kvelxdeveun-001]
module.machine_learning["mlw1"].data.azurerm_application_insights.application_insights: Read complete after 1s [id=/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Insights/components/app-insight-elx-demo-001]
module.machine_learning["mlw1"].data.azurerm_subnet.subnet_mlcc["mlcc1"]: Read complete after 1s [id=/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Network/virtualNetworks/elex-demo-eu2-vnet-0001/subnets/ml-snet-001]
module.machine_learning["mlw1"].data.azurerm_storage_account.storage_account: Read complete after 1s [id=/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.Storage/storageAccounts/stmhradeveunelx01]
module.machine_learning["mlw1"].azurerm_machine_learning_workspace.machine_learning_workspace: Refreshing state... [id=/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.MachineLearningServices/workspaces/azml-elx-dev-eun-01]
module.machine_learning["mlw1"].azurerm_machine_learning_compute_cluster.machine_learning_compute_cluster["mlcc1"]: Refreshing state... [id=/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.MachineLearningServices/workspaces/azml-elx-dev-eun-01/computes/mlcc-elx-dev-eun-01]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.machine_learning["mlw1"].azurerm_machine_learning_compute_cluster.machine_learning_compute_cluster["mlcc1"] must be replaced
-/+ resource "azurerm_machine_learning_compute_cluster" "machine_learning_compute_cluster" {
      ~ id                            = "/subscriptions/fb489ac2-f3a0-47da-9d84-977c7f38e1ce/resourceGroups/elex-demo-eu2-rg-0001/providers/Microsoft.MachineLearningServices/workspaces/azml-elx-dev-eun-01/computes/mlcc-elx-dev-eun-01" -> (known after apply)
        name                          = "mlcc-elx-dev-eun-01"
      ~ ssh_public_access_enabled     = false -> (known after apply)
      - tags                          = {} -> null
      ~ vm_size                       = "STANDARD_DS1_V2" -> "Standard_DS1_v2" # forces replacement
        # (6 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "e3e54ca3-43ce-45d6-b34a-71b9c5e459b5" -> (known after apply)
          ~ tenant_id    = "3c09fd31-93dc-4214-815a-42ccd753f941" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"

```

</details>

<details><summary>Show Checkov Results</summary>


       _               _              
   ___| |__   ___  ___| | _______   __
  / __| '_ \ / _ \/ __| |/ / _ \ \ / /
 | (__| | | |  __/ (__|   < (_) \ V / 
  \___|_| |_|\___|\___|_|\_\___/ \_/  
                                      
By bridgecrew.io | version: 2.4.39 
terraform scan results:

Passed checks: 0, Failed checks: 3, Skipped checks: 0

Check: CKV_AZURE_144: "Ensure that Public Access is disabled for Machine Learning Workspace"
	FAILED for resource: module.machine_learning["mlw1"].azurerm_machine_learning_workspace.machine_learning_workspace
	File: /terraform/modules/machine-learning/ml.tf:1-22
	Calling File: /terraform/env/dev/machine-learning/main.tf:1-11
	Guide: https://docs.paloaltonetworks.com/content/techdocs/en_US/prisma/prisma-cloud/prisma-cloud-code-security-policy-reference/azure-policies/azure-networking-policies/ensure-azure-machine-learning-workspace-is-not-publicly-accessible.html

		1  | resource "azurerm_machine_learning_workspace" "machine_learning_workspace" {
		2  |   name                    = "azml-elx-${var.machine_learning_workspace.env}-eun-${var.machine_learning_workspace.instance_number}"
		3  |   location                = var.machine_learning_workspace.location
		4  |   resource_group_name     = var.machine_learning_workspace.resource_group_name
		5  |   application_insights_id = data.azurerm_application_insights.application_insights.id
		6  |   key_vault_id            = data.azurerm_key_vault.key_vault.id
		7  |   storage_account_id      = data.azurerm_storage_account.storage_account.id
		8  |   # container_registry_id   = data.azurerm_container_registry.container_registry.id
		9  |   sku_name                = try(var.machine_learning_workspace.sku_name, null)
		10 |   description             = try(var.machine_learning_workspace.description, null)
		11 |   friendly_name           = try(var.machine_learning_workspace.friendly_name, null)
		12 |   high_business_impact    = try(var.machine_learning_workspace.high_business_impact, null)
		13 |   tags                    = try(var.machine_learning_workspace.tags, null)
		14 | 
		15 |   dynamic "identity" {
		16 |     for_each = try(var.machine_learning_workspace.identity, null) != null ? [var.machine_learning_workspace.identity] : []
		17 |     content {
		18 |       type = try(var.machine_learning_workspace.identity.type, "SystemAssigned")
		19 |     }
		20 |   }
		21 | 
		22 | }

Check: CKV_AZURE_142: "Ensure Machine Learning Compute Cluster Local Authentication is disabled"
	FAILED for resource: module.machine_learning["mlw1"].azurerm_machine_learning_compute_cluster.machine_learning_compute_cluster
	File: /terraform/modules/machine-learning/ml_compute_cluster.tf:1-36
	Calling File: /terraform/env/dev/machine-learning/main.tf:1-11
	Guide: https://docs.paloaltonetworks.com/content/techdocs/en_US/prisma/prisma-cloud/prisma-cloud-code-security-policy-reference/azure-policies/azure-iam-policies/ensure-azure-machine-learning-compute-cluster-local-authentication-is-disabled.html

		1  | resource "azurerm_machine_learning_compute_cluster" "machine_learning_compute_cluster" {
		2  |   for_each                      = var.machine_learning_compute_cluster
		3  |   name                          = "mlcc-elx-${each.value.env}-eun-${each.value.instance_number}"
		4  |   location                      = each.value.location
		5  |   vm_priority                   = each.value.vm_priority
		6  |   vm_size                       = each.value.vm_size
		7  |   machine_learning_workspace_id = azurerm_machine_learning_workspace.machine_learning_workspace.id
		8  |   subnet_resource_id            = data.azurerm_subnet.subnet_mlcc[each.key].id
		9  |   tags                          = try(each.value.tags, null)
		10 | 
		11 | 
		12 |   dynamic "scale_settings" {
		13 |     for_each = try(each.value.scale_settings, null) != null ? [each.value.scale_settings] : []
		14 |     content {
		15 |       min_node_count                       = try(each.value.min_node_count, 0)
		16 |       max_node_count                       = try(each.value.max_node_count, 1)
		17 |       scale_down_nodes_after_idle_duration = try(each.value.scale_down_nodes_after_idle_duration, "PT30S")
		18 |     }
		19 |   }
		20 | 
		21 |   dynamic "identity" {
		22 |     for_each = try(each.value.identity, null) != null ? [each.value.identity] : []
		23 |     content {
		24 |       type = try(each.value.type, "SystemAssigned")
		25 |     }
		26 |   }
		27 |   
		28 |   lifecycle {
		29 |     ignore_changes        = [
		30 |       machine_learning_workspace_id,
		31 |       subnet_resource_id,
		32 |       tags
		33 |     ]
		34 |   }
		35 | 
		36 | }

Check: CKV_AZURE_150: "Ensure Machine Learning Compute Cluster Minimum Nodes Set To 0"
	FAILED for resource: module.machine_learning["mlw1"].azurerm_machine_learning_compute_cluster.machine_learning_compute_cluster
	File: /terraform/modules/machine-learning/ml_compute_cluster.tf:1-36
	Calling File: /terraform/env/dev/machine-learning/main.tf:1-11
	Guide: https://docs.paloaltonetworks.com/content/techdocs/en_US/prisma/prisma-cloud/prisma-cloud-code-security-policy-reference/azure-policies/azure-general-policies/ensure-azure-machine-learning-compute-cluster-minimum-nodes-is-set-to-0.html

		1  | resource "azurerm_machine_learning_compute_cluster" "machine_learning_compute_cluster" {
		2  |   for_each                      = var.machine_learning_compute_cluster
		3  |   name                          = "mlcc-elx-${each.value.env}-eun-${each.value.instance_number}"
		4  |   location                      = each.value.location
		5  |   vm_priority                   = each.value.vm_priority
		6  |   vm_size                       = each.value.vm_size
		7  |   machine_learning_workspace_id = azurerm_machine_learning_workspace.machine_learning_workspace.id
		8  |   subnet_resource_id            = data.azurerm_subnet.subnet_mlcc[each.key].id
		9  |   tags                          = try(each.value.tags, null)
		10 | 
		11 | 
		12 |   dynamic "scale_settings" {
		13 |     for_each = try(each.value.scale_settings, null) != null ? [each.value.scale_settings] : []
		14 |     content {
		15 |       min_node_count                       = try(each.value.min_node_count, 0)
		16 |       max_node_count                       = try(each.value.max_node_count, 1)
		17 |       scale_down_nodes_after_idle_duration = try(each.value.scale_down_nodes_after_idle_duration, "PT30S")
		18 |     }
		19 |   }
		20 | 
		21 |   dynamic "identity" {
		22 |     for_each = try(each.value.identity, null) != null ? [each.value.identity] : []
		23 |     content {
		24 |       type = try(each.value.type, "SystemAssigned")
		25 |     }
		26 |   }
		27 |   
		28 |   lifecycle {
		29 |     ignore_changes        = [
		30 |       machine_learning_workspace_id,
		31 |       subnet_resource_id,
		32 |       tags
		33 |     ]
		34 |   }
		35 | 
		36 | }



Wrote output in SARIF format to the file 'results.sarif'

</details>

*Pushed by: @amro-acc, Action: `pull_request`, Workflow: `Dev-Apply-Machine-Learning`*